[{
  "_id": {
    "$oid": "63832b459f64b2536469a950"
  },
  "title": "Thor: The",
  "category": "Marvel",
  "content": "Thuở sơ khai, cha của thần Odin, Bor đã chiến đấu với kẻ thù truyền kiếp Dark Elf Malekith, người tìm cách bao phủ vũ trụ trong bóng tối bằng việc sử dụng một vũ khi dạng lỏng được gọi là Aether (thực chất là Viên đá vô cực Hiện Thực). Sau khi đánh bại đội quân của Malekith, bao gồm cả những chiến binh cường hóa được gọi là Kursed, Bor đã quyết định niêm phong Aether trong một cột đá vì không phá hủy được nó. Tuy nhiên Malekith cùng thuộc hạ thân tín của hắn, Algrim và các Dark Elf còn sót lại sau cuộc chiến đã trốn thoát và ẩn dật chờ ngày báo thù.\r\n\r\nTại Asgard hiện tại, Loki bị bắt và tống vào ngục tù vì tội ác chiến tranh mà hắn đã gây ra trên Trái Đất. Trong khi đó Thor cùng các chiến binh trung thành Fandral, Volstagg và Sif tiếp tục chiến đấu tại Vanaheim, vương quốc láng giềng của Hogun. Đó cũng là trận chiến cuối cùng trong cuộc chiến bảo vệ hòa bình của Chín Hành Tinh, sau khi Cầu Nối Chín Vương quốc Bifröst đã bị phá hủy hai năm trước đó, nay đã được khôi phục. Các chiến binh Asgard cũng biết rằng sắp xảy ra một hiện tượng hiếm hoi trong lịch sử gọi là Sự Hội Tụ khi Chín Hành Tinh cùng nằm trên một đường thẳng và sẽ xuất hiện một loạt các cổng liên kết các thế giới với nhau.\r\n\r\nTại London, tiến sĩ vật lý thiên văn Jane Foster cùng thực tập sinh của cô là Darcy Lewis đã đi thám hiểm một nhà máy bị bỏ hoang, nơi cổng liên kết các thế giới xuất hiện và phá vỡ tất cả các quy tắc vật lý xung quanh họ. Jane vô tình bị cuốn vào cổng liên kết đó tới nơi phong ấn Aether, rồi bị chính nó xâm nhập. Khi Heimdall dùng khả năng nhìn xuyên thấu không gian đến Trái Đất thì không thấy Jane, khiến Thor vội vàng đến đó tìm cô. Khi Thor thấy Jane, cô vô tình phát ra một năng lượng kinh hoàng khiến Thor buộc phải đưa cô đến Asgard chữa trị. Sau khi Odin phát hiện được Aether đang ở trong người Jane, ông đã cảnh báo Thor về điềm báo của một lời tiên tri thảm khốc có từ ngàn xưa.\r\n\r\nMalekith được đánh thức bởi năng lượng của Aether, biến Algrim thành Kursed cuối cùng và tấn công Asgard. Trong trận chiến, Malekith và Algrim tìm kiếm Jane, cảm nhận được cô có Aether. Mẹ của Thor là Frigga bị giết khi bảo vệ Jane, còn Malekith và Algrim buộc phải bỏ đi mà không bắt được Jane. Bất chấp lệnh của Odin là ở lại Asgard, Thor miễn cưỡng nhờ sự giúp đỡ của Loki, người biết về một cổng bí mật dẫn đến Svartalfheim, nơi mà họ sẽ sử dụng Jane để thu hút và đối đầu với Malekith tại hành tinh của hắn. Đổi lại, Thor hứa cùng với Loki trả thù Malekith vì đã giết chết mẹ của họ (bản thân Loki còn hối hận vì đã dẫn đường cho Algrim, gián tiếp dẫn tới cái chết của Frigga, người duy nhất dạy dỗ và yêu thương mình). Với việc Volstagg và Sif ngăn cản các chiến binh Asgard và Fandral giúp họ trốn thoát, Thor, Loki và Jane cùng nhau đến Svartalfheim.\r\n\r\nKhi đến nơi, Thor và Loki đã vờ mâu thuẫn, cố ý để Malekith lấy Aether ra từ Jane, rồi Thor phóng một tia sét mạnh để phá hủy Aether nhưng thất bại. Malekith nhập với Aether, còn Loki bị trọng thương sắp chết khi giết Algrim. Thor ôm Loki trong vòng tay của mình, hứa sẽ nói với cha mình về sự hy sinh của anh. Sau đó, Thor và Jane phát hiện ra một cổng mà Jane lạc vào trước đây trong một hang động gần đó và đến London đoàn tụ với Darcy cùng người cố vấn của Jane, Tiến sĩ Erik Selvig - người đã được điều trị một thời gian ngắn do các chấn thương tinh thần ông phải chịu đựng trong cuộc tấn công của Loki trên Trái Đất. Họ biết rằng Malekith có kế hoạch khôi phục lại Dark Elf và thống trị vũ trụ bằng cách giải phóng Aether từ trung tâm của Sự Hội Tụ tại Greenwich. Thor chiến đấu với Malekith thông qua các cổng khác nhau và qua nhiều thế giới cho đến khi có một cánh cổng ngăn cách họ, để cho Malekith không mấy khó khăn đến Trái Đất. Thor trở lại giúp đỡ những người đồng chí sinh tử của mình sử dụng thiết bị khoa học của họ nhằm vận chuyển Malekith đến Svartalfheim, nơi hắn bị nghiền nát bởi con tàu bị hư hại của mình.\r\n\r\nThor trở về Asgard, nơi anh từ chối lời đề nghị lên ngôi vua của Odin và nói với Odin về sự hy sinh của Loki. Sau khi Thor rời khỏi, Odin lúc này hiện nguyên hình là Loki cải trang (đồng nghĩa với việc Loki đã giả chết), mãn nguyện với kế hoạch thành công mỹ mãn của mình. Giờ đây Loki chính thức thống trị Asgard.\r\n\r\nTrong một cảnh mid-credits, Volstagg và Sif đến thăm Tivan và giao hộp đựng Aether cho ông ta, giải thích rằng Tesseract đang ở Asgard và để hai Infinity Stone quá gần nhau sẽ rất nguy hiểm. Khi họ rời đi, Tivan nói \"Được một cái, còn năm nữa\". Trong một đoạn post-credits, Jane và Thor tái hợp nhau trên Trái Đất trong khi ở đâu đó tại London, một con quái vật băng giá từ Jotunheim vô tình được đưa đến Trái Đất trong trận chiến cuối cùng, nó tiếp tục chạy điên cuồng.",
  "image": "image_1669540677930_thor 2.avif",
  "created": {
    "$date": {
      "$numberLong": "1669540677932"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "63832be99f64b2536469a951"
  },
  "title": "Thor: Ragnarok",
  "category": "Marvel",
  "content": "Thuở sơ khai, cha của thần Odin, Bor đã chiến đấu với kẻ thù truyền kiếp Dark Elf Malekith, người tìm cách bao phủ vũ trụ trong bóng tối bằng việc sử dụng một vũ khi dạng lỏng được gọi là Aether (thực chất là Viên đá vô cực Hiện Thực). Sau khi đánh bại đội quân của Malekith, bao gồm cả những chiến binh cường hóa được gọi là Kursed, Bor đã quyết định niêm phong Aether trong một cột đá vì không phá hủy được nó. Tuy nhiên Malekith cùng thuộc hạ thân tín của hắn, Algrim và các Dark Elf còn sót lại sau cuộc chiến đã trốn thoát và ẩn dật chờ ngày báo thù.\r\n\r\nTại Asgard hiện tại, Loki bị bắt và tống vào ngục tù vì tội ác chiến tranh mà hắn đã gây ra trên Trái Đất. Trong khi đó Thor cùng các chiến binh trung thành Fandral, Volstagg và Sif tiếp tục chiến đấu tại Vanaheim, vương quốc láng giềng của Hogun. Đó cũng là trận chiến cuối cùng trong cuộc chiến bảo vệ hòa bình của Chín Hành Tinh, sau khi Cầu Nối Chín Vương quốc Bifröst đã bị phá hủy hai năm trước đó, nay đã được khôi phục. Các chiến binh Asgard cũng biết rằng sắp xảy ra một hiện tượng hiếm hoi trong lịch sử gọi là Sự Hội Tụ khi Chín Hành Tinh cùng nằm trên một đường thẳng và sẽ xuất hiện một loạt các cổng liên kết các thế giới với nhau.\r\n\r\nTại London, tiến sĩ vật lý thiên văn Jane Foster cùng thực tập sinh của cô là Darcy Lewis đã đi thám hiểm một nhà máy bị bỏ hoang, nơi cổng liên kết các thế giới xuất hiện và phá vỡ tất cả các quy tắc vật lý xung quanh họ. Jane vô tình bị cuốn vào cổng liên kết đó tới nơi phong ấn Aether, rồi bị chính nó xâm nhập. Khi Heimdall dùng khả năng nhìn xuyên thấu không gian đến Trái Đất thì không thấy Jane, khiến Thor vội vàng đến đó tìm cô. Khi Thor thấy Jane, cô vô tình phát ra một năng lượng kinh hoàng khiến Thor buộc phải đưa cô đến Asgard chữa trị. Sau khi Odin phát hiện được Aether đang ở trong người Jane, ông đã cảnh báo Thor về điềm báo của một lời tiên tri thảm khốc có từ ngàn xưa.\r\n\r\nMalekith được đánh thức bởi năng lượng của Aether, biến Algrim thành Kursed cuối cùng và tấn công Asgard. Trong trận chiến, Malekith và Algrim tìm kiếm Jane, cảm nhận được cô có Aether. Mẹ của Thor là Frigga bị giết khi bảo vệ Jane, còn Malekith và Algrim buộc phải bỏ đi mà không bắt được Jane. Bất chấp lệnh của Odin là ở lại Asgard, Thor miễn cưỡng nhờ sự giúp đỡ của Loki, người biết về một cổng bí mật dẫn đến Svartalfheim, nơi mà họ sẽ sử dụng Jane để thu hút và đối đầu với Malekith tại hành tinh của hắn. Đổi lại, Thor hứa cùng với Loki trả thù Malekith vì đã giết chết mẹ của họ (bản thân Loki còn hối hận vì đã dẫn đường cho Algrim, gián tiếp dẫn tới cái chết của Frigga, người duy nhất dạy dỗ và yêu thương mình). Với việc Volstagg và Sif ngăn cản các chiến binh Asgard và Fandral giúp họ trốn thoát, Thor, Loki và Jane cùng nhau đến Svartalfheim.\r\n\r\nKhi đến nơi, Thor và Loki đã vờ mâu thuẫn, cố ý để Malekith lấy Aether ra từ Jane, rồi Thor phóng một tia sét mạnh để phá hủy Aether nhưng thất bại. Malekith nhập với Aether, còn Loki bị trọng thương sắp chết khi giết Algrim. Thor ôm Loki trong vòng tay của mình, hứa sẽ nói với cha mình về sự hy sinh của anh. Sau đó, Thor và Jane phát hiện ra một cổng mà Jane lạc vào trước đây trong một hang động gần đó và đến London đoàn tụ với Darcy cùng người cố vấn của Jane, Tiến sĩ Erik Selvig - người đã được điều trị một thời gian ngắn do các chấn thương tinh thần ông phải chịu đựng trong cuộc tấn công của Loki trên Trái Đất. Họ biết rằng Malekith có kế hoạch khôi phục lại Dark Elf và thống trị vũ trụ bằng cách giải phóng Aether từ trung tâm của Sự Hội Tụ tại Greenwich. Thor chiến đấu với Malekith thông qua các cổng khác nhau và qua nhiều thế giới cho đến khi có một cánh cổng ngăn cách họ, để cho Malekith không mấy khó khăn đến Trái Đất. Thor trở lại giúp đỡ những người đồng chí sinh tử của mình sử dụng thiết bị khoa học của họ nhằm vận chuyển Malekith đến Svartalfheim, nơi hắn bị nghiền nát bởi con tàu bị hư hại của mình.\r\n\r\nThor trở về Asgard, nơi anh từ chối lời đề nghị lên ngôi vua của Odin và nói với Odin về sự hy sinh của Loki. Sau khi Thor rời khỏi, Odin lúc này hiện nguyên hình là Loki cải trang (đồng nghĩa với việc Loki đã giả chết), mãn nguyện với kế hoạch thành công mỹ mãn của mình. Giờ đây Loki chính thức thống trị Asgard.\r\n\r\nTrong một cảnh mid-credits, Volstagg và Sif đến thăm Tivan và giao hộp đựng Aether cho ông ta, giải thích rằng Tesseract đang ở Asgard và để hai Infinity Stone quá gần nhau sẽ rất nguy hiểm. Khi họ rời đi, Tivan nói \"Được một cái, còn năm nữa\". Trong một đoạn post-credits, Jane và Thor tái hợp nhau trên Trái Đất trong khi ở đâu đó tại London, một con quái vật băng giá từ Jotunheim vô tình được đưa đến Trái Đất trong trận chiến cuối cùng, nó tiếp tục chạy điên cuồng.",
  "image": "image_1669540841731_thor 3.jpg",
  "created": {
    "$date": {
      "$numberLong": "1669540841733"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "63832c379f64b2536469a952"
  },
  "title": "Thor: Love and Thunder",
  "category": "Marvel",
  "content": "Gorr và con gái của hắn, Love, người cuối cùng của chủng tộc của họ, vật lộn trong một sa mạc cằn cỗi. Bất chấp những lời cầu nguyện của họ với vị thần của họ, Rapu, Love vẫn chết. Vũ khí giết thần Necrosword gọi Gorr, dẫn hắn đến vương quốc tươi tốt của Rapu. Sau khi Rapu chế giễu hoàn cảnh của Gorr một cách độc ác, hắn từ bỏ vị thần, khiến Rapu phải bóp cổ hắn ta. Necrosword tự hiến mình cho Gorr, người đã giết Rapu bằng nó và thề sẽ giết tất cả các vị thần. Gorr được ban cho khả năng điều khiển bóng tối và tạo ra quái vật, nhưng bị nguyền rủa với cái chết sắp xảy ra và sự tha hóa dưới ảnh hưởng của thanh kiếm. Sau khi Gorr giết một số vị thần, Thor, người đã tham gia Vệ binh dải ngân hà,[N 2] biết được tín hiệu báo động từ Sif. Anh chia tay đội và tìm thấy Sif đang bị thương, anh ta cảnh báo rằng mục tiêu tiếp theo của Gorr là New Asgard. Trong khi đó, Tiến sĩ Jane Foster, bạn gái cũ của Thor, được chẩn đoán mắc ung thư giai đoạn cuối. Với việc điều trị y tế không hiệu quả, cô đến New Asgard với hy vọng rằng chiếc búa Mjolnir của Thor, thứ đã bị Hela phá hủy trước đó,[N 3] có thể chữa lành cho cô.\r\n\r\nDo một loại bùa mà Thor vô tình đặt vào nó nhiều năm trước đó để bảo vệ Foster, Mjolnir đã tái trang bị và gắn kết bản thân với cô ấy. Thor đến New Asgard ngay khi cuộc tấn công của Gorr bắt đầu. Thor ngạc nhiên khi thấy Foster sử dụng Mjolnir, nhưng lại hợp tác với cô ấy, Valkyrie và Korg để chống lại Gorr. Cả nhóm ngăn cản Gorr, nhưng hắn trốn thoát, bắt cóc một số trẻ em Asgard và giam chúng trong Cõi Bóng tối. Được thừa hưởng khả năng của người cha đã khuất Heimdall, con trai của ông là Axl liên lạc với Thor, người có thể tương tác với lũ trẻ. Cả nhóm đi đến Thành phố Omnipotence để cảnh báo các vị thần khác và yêu cầu họ giúp đỡ trong việc tạo ra một đội quân. Thủ lĩnh của các vị thần, Zeus, sợ hãi Gorr và không sẵn sàng giúp đỡ, nghĩ rằng họ có thể vẫn an toàn và ẩn mình khỏi Gorr trong Thành phố. Zeus ra lệnh bắt giữ nhóm để ngăn họ tiết lộ vị trí của Thành phố cho Gorr. Khi Zeus làm Korg bị thương, Thor đã đâm chết Zeus bằng lưỡi tầm sét của chính mình mà Valkyrie đã đánh cắp trước khi họ trốn thoát. Khi cuộc hành trình tiếp tục, Thor và Foster khơi lại mối quan hệ lãng mạn của họ và Foster tiết lộ căn bệnh của cô.\r\n\r\nCả nhóm đến Cõi Bóng tối nhưng không thể xác định được vị trí của bọn trẻ. Foster nhìn thấy những hình vẽ cổ đại mô tả Stormbreaker như một cách để triệu hồi Bifrost để vào cõi vĩnh hằng và suy ra cái bẫy do Gorr bày ra. Cô ném Stormbreaker đi để ngăn Gorr tiếp cận nó. Tuy nhiên, Gorr áp đảo nhóm và đe dọa giết Foster buộc Thor phải triệu hồi nó trở lại. Trong trận chiến sau đó, Gorr làm Valkyrie bị thương nặng. Cả nhóm trở về Trái đất và Gorr đánh cắp Stormbreaker. Hút hết sức lực của cô ấy mỗi khi sử dụng Mjolnir, Foster được cảnh báo rằng sử dụng nó một lần nữa sẽ có thể giết chết cô ấy. Thor thuyết phục Foster để anh ta chiến đấu với Gorr một mình trong khi cô ấy hồi phục. Thor tìm thấy những đứa trẻ bị bắt cóc tại đền thờ của Eternity và, sử dụng lưỡi tầm sét của Zeus, truyền cho chúng sức mạnh của mình để chống lại quái vật của Gorr trong khi chiến đấu với Gorr. Khi Foster cảm nhận được rằng Gorr sắp giết Thor, cô đã tham gia trận chiến với Mjolnir để cứu anh. Họ phá hủy Necrosword, giải phóng Gorr khỏi ảnh hưởng của nó, nhưng cả ba được đưa vào cõi Eternity. Khi Gorr sẵn sàng thực hiện điều ước của mình, Thor cầu xin Gorr hồi sinh con gái mình thay vì tiêu diệt các vị thần.\r\n\r\nThor sau đó để Gorr đưa ra quyết định của mình và chăm sóc Foster, người đã chống chọi với bệnh tật của cô và chết trong vòng tay của anh. Bị xúc động bởi cảnh tượng của họ, Gorr mong muốn Eternity hồi sinh Love, thứ mà nó ban tặng. Khi Gorr chết vì lời nguyền, hắn yêu cầu Thor chăm sóc cho Love. Sau đó, những đứa trẻ trở lại New Asgard, nơi Valkyrie và Sif bắt đầu huấn luyện chúng, và một tượng đài để vinh danh Foster được xây dựng. Thor nhận Love, người đã tham gia cùng anh trong các câu chuyện anh hùng của mình, với Mjolnir trước đây sử dụng và Stormbreaker sử dụng bởi Love. Trong một cảnh mid-credit, trở lại Thành phố Omnipotence, thần Zeus đang hồi phục sức khỏe đã gửi con trai của mình là Hercules để giết Thor. Trong một cảnh post-credit, Foster đến cổng Valhalla, nơi Heimdall chào đón cô.",
  "image": "image_1669540919994_thor 4.jpg",
  "created": {
    "$date": {
      "$numberLong": "1669540919996"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "6385fafecaf16329d41856eb"
  },
  "title": "Naruto",
  "category": "Anime",
  "content": "naruto",
  "image": "image_1669724926522_naruto_sh.png",
  "created": {
    "$date": {
      "$numberLong": "1669724926576"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "6387032b41171e379c67e5eb"
  },
  "title": "Conan",
  "category": "Anime",
  "content": "the conan detective",
  "image": "image_1669792555681_co.webp",
  "created": {
    "$date": {
      "$numberLong": "1669792555691"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "6387064441171e379c67e5ed"
  },
  "title": "sdfcszd",
  "category": "vsV DZ",
  "content": "vssdvsdv",
  "image": "image_1669793348309_Gintama.webp",
  "created": {
    "$date": {
      "$numberLong": "1669793348340"
    }
  },
  "__v": 0
}]